import re


SPACE = r"[ \n\t]"
ANY = r"(.+)"

NUMBER = r"([0-9]+)(\.[0-9]+)?"
LETTER_NUMBER = r"({number})(k|к)".format(number=NUMBER)

# Показатели времени
HOUR = r"час(а|ам|ами|ах|е|ов|ом|у|ы)?"
MINUTE = r"минут(а|ам|ами|ах|е|ой|у|ы)?"
SECOND = r"секунд(а|ам|ами|ах|е|ой|у|ы)?"
HALF_HOUR = r"полчас(а|ам|ами|ах|е|ой|у|ы)?"
HOUR_AND_HALF = r"полтор(а|ы){space}{hour}".format(space=SPACE, hour=HOUR)

# Показатели даты
TODAY = r"сегодня"
YESTERDAY = r"вчера"
TOMORROW = r"завтра"

# Времена года
AUGUST = r"август(а|ам|ами|ах|е|ов|ом|у|ы)?"
APRIL = r"апрел(е|ей|ем|и|ь|ю|я|ям|ями|ях)"
DECEMBER = r"декабр(ь|и|я|ей|ю|ям|ём|ями|е|ях)"
JULY = r"июл(ь|и|я|ей|ю|ям|ем|ями|е|ях)"
JUNE = r"июн(ь|и|я|ей|ю|ям|ем|ями|е|ях)"
MAY = r"ма(й|и|я|ев|ю|ям|ем|ями|е|ях)"
MARCH = r"март(ы|а|ов|у|ам|ом|ами|е|ах)?"
NOVEMBER = r"ноябр(ь|и|я|ей|ю|ям|ём|ями|е|ях)"
OCTOBER = r"октябр(ь|и|я|ей|ю|ям|ём|ями|е|ях)"
SEPTEMBER = r"сентябр(ь|и|я|ей|ю|ям|ём|ями|е|ях)"
FEBRUARY = r"феврал(ь|и|я|ей|ю|ям|ём|ями|е|ях)"
JANUARY = r"январ(ь|и|я|ей|ю|ям|ём|ями|е|ях)"

# Показатель веса
WEIGHT = r"ве(с|са|сов|су|сам|сом|сами|се|сах|сить|шу)"

# Показатели денег
RUBLES = r"((рубл(е|ей|ём|и|ь|ю|я|ям|ями|ях))|₽)"
DOLLARS = r"((доллар(а|ам|ами|ах|е|ов|ом|у|ы)?)|(бакс(|а|ам|ами|ах|е|ов|ом|у|ы)?)|\$)"
EURO = r"(евро|€)"

# Shortcut для использования в правилах
UI = re.UNICODE | re.IGNORECASE

# Константы замены
NUM_POINTER = "NUM"
DATE_POINTER = "DATEPOINTER"
TIME_POINTER = "TIMEPOINTER"
WEIGHT_POINTER = "WEIGHTPOINTER"
